#include <stdio.h>

// Постановка задачи:
// Написать функцию, которая сжимает серии массива, состоящего из единиц и нулей по следующему принципу:
// например, массив [0,0,0,0,1,1,1,1,1,1,1,0,0,1,1,1,1] преобразуется в [4,7,2,4]
// (т.к. начинается с нуля, то сразу записывается количество элементов первой серии);
// а массив [1,1,1,0,0,0,0,0,0,0] преобразуется в [0,3,7]
// (т.к. первая серия - это единицы, то первый элемент преобразованного массива 0).
// Входныне данные: Функция принимает исходный массив a[] и сжимает в массив b[], N - число элементов в массиве a[].
// Выходные данные: Функция возвращает число элементов сжатого массива b[]

int main(int argv, char **argc)
{

    return 0;
}
